# vstSetPtBehavior

## Description
```pascal
PROCEDURE vstSetPtBehavior(inStatusType : LONGINT);
```

```python

def vs.vstSetPtBehavior(inStatusType):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inStatusType|LONGINT||

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events